cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "heroku/brew"
tap "TylerBrock/saw"

brew "aws-shell"
brew "awscli"
brew "bash-completion"
brew "fish"
brew "ghq"
brew "gibo"
brew "gnupg"
brew "heroku"
brew "hub"
brew "jq"
brew "kotlin"
brew "kubernetes-cli"
brew "lazydocker"
brew "node"
brew "peco"
brew "pipenv"
brew "pyenv"
brew "python3"
brew "redis"
brew "ruby"
brew "saw"
brew "terraform"
brew "weaveworks/tap/eksctl"

cask "adobe-acrobat-reader"
cask "alfred"
cask "aws-vault"
cask "dash"
cask "diskwave"
cask "docker"
cask "google-chrome"
cask "google-cloud-sdk"
cask "inkdrop"
cask "intellij-idea-ce"
cask "iterm2"
cask "java"
cask "kindle"
cask "minikube"
cask "ngrok"
cask "postman"
cask "skype"
cask "slack"
cask "tower"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
