DavidAnson.vscode-markdownlint
eamodio.gitlens
johnpapa.vscode-peacock
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-python.python
streetsidesoftware.code-spell-checker
VisualStudioExptTeam.vscodeintellicode
WakaTime.vscode-wakatime

# bash supports
shakram02.bash-beautify
rogalmic.bash-debug
mads-hartmann.bash-ide-vscode
