# general
coenraads.bracket-pair-colorizer
eamodio.gitlens
johnpapa.vscode-peacock
mechatroner.rainbow-csv
ms-azuretools.vscode-docker
ms-vsliveshare.vsliveshare
oderwat.indent-rainbow
streetsidesoftware.code-spell-checker
VisualStudioExptTeam.vscodeintellicode
WakaTime.vscode-wakatime

# mutli languages
esbenp.prettier-vscode

# bash supports
timonwong.shellcheck
shakram02.bash-beautify
rogalmic.bash-debug
mads-hartmann.bash-ide-vscode

# HTML/CSS
stylelint.vscode-stylelint

# JavaScript/TypeScript
dbaeumer.vscode-eslint

# python
ms-python.python

# markdown
DavidAnson.vscode-markdownlint

# YAML
redhat.vscode-yaml
