cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "aws/tap"
tap "heroku/brew"
tap "hiroga-cc/aws-session-manager-plugin"
tap "mongodb/brew"
tap "TylerBrock/saw"

brew "amazon-ecs-cli"
brew "aws-shell"
brew "awscli"
brew "aws-sam-cli"
brew "aws-session-manager-plugin"
brew "bash-completion"
brew "chamber"
brew "circleci"
brew "dep"
brew "fish"
brew "ghq"
brew "gibo"
brew "git"
brew "go"
brew "graphviz"
brew "gnupg"
brew "heroku"
brew "hub"
brew "jq"
brew "kotlin"
brew "kubernetes-cli"
brew "lazydocker"
brew "mas"
brew "maven"
brew "mongodb-community"
brew "node"
brew "peco"
brew "pipenv"
brew "postgresql"
brew "pyenv"
brew "redis"
brew "ruby"
brew "rbenv"
brew "ruby-build"
brew "saw"
brew "telnet"
brew "terraform"
brew "tmux"
brew "tree"
brew "yarn"
brew "yq"

cask "adobe-acrobat-reader"
cask "adoptopenjdk"
cask "alfred"
cask "amazon-workspaces"
cask "android-studio"
cask "aws-vault"
cask "dash"
cask "dbeaver-community"
cask "discord"
cask "diskwave"
cask "docker"
cask "fastlane"
cask "fork"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive-file-stream"
cask "google-japanese-ime"
cask "gyazo"
cask "inkdrop"
cask "java"
cask "jetbrains-toolbox"
cask "keybase"
cask "kindle"
cask "minikube"
cask "ngrok"
cask "onedrive"
cask "postman"
cask "skype"
cask "slack"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"

mas "Cyberduck", id: 409222199
mas "LINE", id: 539883307
mas "Tweetdeck", id: 485812721
mas "Xcode", id: 497799835
