cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "hiroga-cc/homebrew-cask"
tap "mongodb/brew"

brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "grep"

brew "arp-scan"
brew "anyenv"
brew "bash"
brew "bash-completion"
brew "csvkit"
brew "dep"
brew "exa"
brew "fish"
brew "ghi"
brew "ghq"
brew "gibo"
brew "git"
brew "go"
brew "gradle"
brew "gnupg"
brew "haskell-stack"
brew "helm"
brew "hub"
brew "jq"
brew "kotlin"
brew "kubernetes-cli"
brew "lazydocker"
brew "mas"
brew "maven"
brew "minikube"
brew "mongodb-community"
brew "mysql"
brew "node"
brew "peco"
brew "pipenv"
brew "postgresql"
# Linux ps command can not be imported to OSX, https://apple.stackexchange.com/questions/187783/can-i-use-gnu-ps-on-os-x
brew "psgrep"
brew "pstree"
brew "redis"
brew "ruby"
brew "ruby-build"
brew "shellcheck"
brew "telnet"
brew "terraform"
brew "tmux"
brew "tree"
brew "yarn"
brew "yq"
brew "zsh-syntax-highlighting"

cask "adobe-acrobat-reader"
cask "adoptopenjdk"
cask "alfred"
cask "dash"
cask "discord"
cask "diskwave"
cask "docker"
cask "fastlane"
cask "fork"
cask "google-chrome"
cask "google-drive-file-stream"
cask "google-japanese-ime"
cask "gyazo"
cask "imageoptim"
cask "inkdrop"
cask "java"
cask "kap"
cask "keybase"
cask "kindle"
cask "minikube"
cask "mongodb-compass"
cask "ngrok"
cask "onedrive"
cask "skype"
cask "slack"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"

mas "Bandwidth+", id: 490461369
mas "Cyberduck", id: 409222199
mas "Hex Fiend", id: 1342896380
mas "LINE", id: 539883307
mas "The Unarchiver", id: 425424353
mas "Tweetdeck", id: 485812721
mas "Xcode", id: 497799835
