cask_args appdir: "/Applications"
tap "homebrew/cask"
tap "aws/tap"
tap "graalvm/tap"
tap "heroku/brew"
tap "hiroga-cc/aws-session-manager-plugin"
tap "hiroga-cc/tap"
tap "mongodb/brew"
# tap "octave-app/octave-app"
tap "TylerBrock/saw"
tap "weaveworks/tap"

brew "coreutils"
brew "findutils"
brew "gnu-tar"
brew "gnu-sed"
brew "gawk"
brew "gnutls"
brew "gnu-indent"
brew "gnu-getopt"
brew "grep"

brew "arp-scan"
brew "amazon-ecs-cli"
brew "anyenv"
brew "aws-cdk"
brew "awscli"
brew "awscurl"
brew "awslogs"
brew "aws-session-manager-plugin"
brew "bash"
brew "bash-completion"
brew "chamber"
brew "circleci"
brew "cookiecutter"
brew "csvkit"
brew "dep"
brew "exa"
brew "gh"
brew "ghq"
brew "gibo"
brew "git"
brew "git-lfs"
brew "go"
brew "gradle"
brew "graphviz"
brew "gnupg"
brew "haskell-stack"
brew "helm"
brew "heroku"
brew "jq"
brew "kotlin"
brew "kubernetes-cli"
brew "lazydocker"
brew "mas"
brew "maven"
brew "mongodb-community"
brew "mongodb-database-tools"
brew "mysql"
brew "node"
brew "octave"
brew "peco"
brew "pipenv"
brew "postgresql"
# Linux ps command can not be imported to OSX, https://apple.stackexchange.com/questions/187783/can-i-use-gnu-ps-on-os-x
brew "psgrep"
brew "pstree"
brew "redis"
brew "ruby"
brew "ruby-build"
brew "saw"
brew "shellcheck"
brew "telnet"
brew "terraform"
brew "tmux"
brew "tree"
brew "weaveworks/tap/eksctl"
brew "yarn"
brew "yq"
brew "zsh-syntax-highlighting"

cask "adobe-acrobat-reader"
cask "adobe-creative-cloud"
cask "adoptopenjdk"
cask "alfred"
cask "aws-vault"
cask "cocoapods"
cask "dash"
# cask "dbeaver-community" # has invocation problem at 2020-04-14 now. please install from https://dbeaver.io/download/
cask "deepl"
cask "discord"
cask "diskwave"
cask "docker"
cask "fastlane"
cask "fork"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive-file-stream"
cask "google-japanese-ime"
cask "graalvm-ce-java8"
cask "gyazo"
cask "imageoptim"
cask "inkdrop"
cask "java"
cask "jetbrains-toolbox"
cask "kap"
cask "keybase"
cask "kindle"
cask "karabiner-elements"
cask "minikube"
cask "mongodb-compass"
cask "ngrok"
# cask "octave-app"
cask "onedrive"
cask "postman"
cask "skype"
cask "slack"
cask "stoplight-next"
cask "unity-hub"
cask "vagrant"
cask "virtualbox-5.2"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "zoomus"

mas "Bandwidth+", id: 490461369
mas "Cyberduck", id: 409222199
mas "Hex Fiend", id: 1342896380
mas "LINE", id: 539883307
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
mas "Microsoft Word", id: 462054704
mas "The Unarchiver", id: 425424353
mas "Tweetdeck", id: 485812721
mas "Xcode", id: 497799835
